tap "coursier/formulas"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "messense/macos-cross-toolchains"
tap "microsoft/git"
tap "ngrok/ngrok"
tap "railwaycat/emacsmacport"
brew "awscli"
brew "bash"
brew "bat"
brew "binutils"
brew "coreutils"
brew "cask"
brew "ccls"
brew "clang-format"
brew "cmake"
brew "curl"
brew "diffutils"
brew "exa"
brew "fd"
brew "findutils"
brew "gawk"
brew "ghq"
brew "git"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "grep"
brew "pkg-config"
brew "gzip"
brew "hexyl"
brew "htop"
brew "hub"
brew "jq"
brew "markdown"
brew "moreutils"
brew "neofetch"
brew "nmap"
brew "pandoc"
brew "peco"
brew "postgresql@14"
brew "procs"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "scrcpy"
brew "starship"
brew "swagger-codegen"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
brew "coursier/formulas/coursier"
brew "dart-lang/dart/dart"
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-musl"
cask "emacs-mac"
cask "git-credential-manager-core"
cask "iterm2"
cask "ngrok"
cask "visual-studio-code"
cask "xquartz"
