cask
ccls
clang-format
clinfo
cmake
coreutils
curl
diffutils
findutils
gdbm
gettext
ghq
gmp
gnutls
icu4c
libevent
libffi
libidn2
libtasn1
libunistring
libyaml
llvm
lua
markdown
ncurses
nettle
node
openssl
openssl@1.1
p11-kit
pandoc
pcre
peco
perl
pkg-config
python
python@3.8
readline
ruby
sqlite
swig
tmux
tree
unbound
utf8proc
vim
wget
xz
zsh
