tap "coderabbitai/tap"
tap "dart-lang/dart", trusted: true
tap "homebrew/bundle"
tap "homebrew/services"
tap "microsoft/git", trusted: true
tap "ngrok/ngrok", trusted: true
tap "railwaycat/emacsmacport", trusted: true
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Emacs dependency management
brew "cask"
# C/C++/ObjC language server
brew "ccls"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# USB programmer
brew "dfu-util"
# File comparison utilities
brew "diffutils"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Audio codec
brew "opus"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of time utility
brew "gnu-time"
# GNU grep, egrep and fgrep
brew "grep"
# Popular GNU data compression program
brew "gzip"
# Command-line hex viewer
brew "hexyl"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# Convenience library for creating .opus files
brew "libopusenc"
# Postgres C API library
brew "libpq", link: true
# Text-to-HTML conversion tool
brew "markdown"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Fast, highly customisable system info script
brew "neofetch"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Node.js version manager
brew "nodenv"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Simplistic interactive filtering tool
brew "peco"
# Object-relational database system
brew "postgresql@16"
# Modern replacement for ps written in Rust
brew "procs"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Used as a compiler wrapper and avoids compilation when possible
brew "sccache"
# Display and control your Android device
brew "scrcpy"
# SOund eXchange: universal sound sample translator
brew "sox"
# Cross-shell prompt for astronauts
brew "starship"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# CI-Friendly tool to document a database
brew "tbls"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Git worktree manager with editor and AI tool integration
brew "coderabbitai/tap/git-gtr", link: false, trusted: true
# SDK
brew "dart-lang/dart/dart", trusted: true
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
cask "railwaycat/emacsmacport/emacs-mac"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source code editor
cask "visual-studio-code"
# Open-source version of the X.Org X Window System
cask "xquartz"
