tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "messense/macos-cross-toolchains"
brew "awscli"
brew "bat"
brew "binutils"
brew "coreutils"
brew "pkg-config"
brew "cask"
brew "ccls"
brew "clang-format"
brew "cmake"
brew "curl"
brew "diffutils"
brew "exa"
brew "findutils"
brew "gawk"
brew "ghq"
brew "git"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "grep"
brew "gzip"
brew "htop"
brew "hub"
brew "markdown"
brew "moreutils"
brew "nmap"
brew "nodebrew"
brew "pandoc"
brew "peco"
brew "postgresql"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rust-analyzer"
brew "starship"
brew "swagger-codegen"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
brew "dart-lang/dart/dart"
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-musl"
cask "emacs"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "netron"
cask "visual-studio-code"
cask "xquartz"
